/* Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
3, 5 -> 243 (3⁵)
2, 4 -> 16 */


/* void f(double a)
{
Console.Write("введите степень числа: ");
int b = Convert.ToInt32(Console.ReadLine());
a = Math.Pow(a, b);
Console.WriteLine(a);
}
Console.Clear();
Console.Write("введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
f(a);
*/
